# HostCutoutForInsertionFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..HostCutoutForInsertionFailure Property
BuiltInFailures..::..CutFailures Class See Also
---
Can't cut host for inserted objects
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostCutoutForInsertionFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostCutoutForInsertionFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace